{"title":"Pushpika De Silva re-crowned Mrs. Sri Lanka 2021","post":"2021-04-06-news-lk-830e-4984bb5e","url":"https://www.newsfirst.lk/2021/04/05/pushpika-de-silva-re-crowned-mrs-sri-lanka-2021/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st);  Reports have confirmed that Pushpika De Silva was re-crowned as Mrs Sri Lanka for Mrs World on Monday (05), following a dramatic end to Sunday’s (04) pageant.The Mrs. Sri Lanka 2021 pageant held at the Nelum Pokuna Theatre on Sunday (04) night concluded in a melee after the reigning Mrs. World Caroline Jurie stripped the winner of her crown after she was announced.The Crown for Mrs. Sri Lanka 2021 went to the first runner-up instead.According to video footage Pushpika De Silva, contestant number 20 was announced as Mrs. Sri Lanka 2021 and was crowned by Shiranthi Rajapaksa, Mayor Rosy Senanayake, and Chandimal Jayasinghe.However, when Pushpika De Silva was about to take center stage and cherish the moment, Caroline Jurie stormed on stage and said the pageant rule note that divorcees cannot be crowned as winners and took away the crown from De Silva, despite some protests from the winner.She charged that Pushpika De Silva was a divorcee and hence was ineligible to win the crown.Mrs. World 2020 Caroline Jurie was seen placing the crown on the first runner-up’s head while Pushpika De Silva stormed off stage.Pushpika De Silva insists she had not violated the pageant rules.Pushpika De Silva in a statement on her official Facebook account penned that she is not a divorcee and challenged the organizers to produce any document to claim that she was divorced.“Living separately and being divorced are two completely separate things,” she said in the statement stressing that she is not a divorcee even at the time of posting the statement.“Real queens fix each other’s crowns,” she said in the statement.Pushpika De Silva went on to note that if she was not suitable for the contest, she should have been removed at the very beginning adding the organizers could not have been asleep when she was moving ahead in the pageant.“I have already taken the necessary legal action against the injustice and humiliation caused to me at the event,” she added.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "}
