{"title":"‘Aluth Sahal Mangalya’ held","post":"2021-04-06-sunday-observer-69b3-463d802d","url":"http://www.sundayobserver.lk/2021/04/04/news/%E2%80%98aluth-sahal-mangalya%E2%80%99-held","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"The National ‘Aluth Sahal Mangalya’ (New Rice Festival) one of the most venerated ancient agricultural rituals to offer the maiden harvest of Maha season to the Lord Buddha was held today (04) under the patronage of President Gotabaya Rajapaksa at the sacred Sri Maha Bodhiya premises.It is an annual custom to set aside the first portion of the recently recede harvest to prepare Buddha Pooja. The event was organized by the Ministry of Agriculture and the Department of Agrarian Services for the 54th time under the guidance of Chief Incumbent of Atamasthana Ven. Prof. Pallegama Sirinivasa Nayaka thero.A large number of farmers from different parts of the country were present at the traditional ceremony with the hope of receiving blessings of the nature and the Triple Gem to receive timely showers, bountiful of harvest and prosperous economy for the country.Following the ancient traditions, the New Rice Festival Perahera (procession) entered the Bo Maluwa through the eastern wahalkada amidst hewisi sounds and filled the gold-plated bowl set up in the pavilion in front of sacred Jaya Sri Maha Bodhi, with rice with great respect and devoutness.President Gotabaya Rajapaksa performed the traditional custom of filling the bowl with fresh rice amidst the chanting of Seth Pirith by the Maha Sangha led by Ven. Pallegama Sirinivasa Nayaka Thero.Afterwards, the Miniters and MPs as well as a large number of farmers from different parts of the country filled the bowl with fresh rice.The first copy of the magazine compiled by the Department of Agrarian Development to mark the New Rice Festival was presented to the President Rajapaksa by the Commissioner General of Agrarian Development  Mr.A.H.M.L. Abeyratne.Basnayake Nilame of the Saman Devalaya Nigara Jayasundara Bandara handed over the bowl of ghee to the President to pay homage to the sacred Jaya Sri Maha Bodhi.            The pure bee honey bowl traditionally offered to the sacred Jayasri Maha Bodhiya by the indigenous community was handed over to the President by Uruwarige Gunabanda representing his Leader Wannila Aththo.The President symbolically distributed seed paddy blessed with Seth Pirith to the representatives of the farmers’ unions from 9 provinces.Following the traditional ceremony, the President paid homage to the sacred Sri Maha Bodhiya, and obtained blessings.Later, the President and Madam Ioma Rajapaksa called on the Chief Incumbent of Atamasthana Ven. Prof. Pallegama Sirinivasa Nayaka thero and inquired about his well-being.The Maha Sangha, Minister of Agriculture Mahindananda Aluthgamage, Minister S.M. Chandrasena, Governor of the North Central Province Maheepala Herath, State Ministers Duminda Dissanayake, Shashindra Rajapaksa, Shehan Semasinghe, Channa Jayasumana, MP K.P.S. Kumarasiri,  and public officials were present at the occasion."}
