[{"title":"Price of Brown Sugar reduced by Rs. 10","post":"2021-04-07-news-lk-7077-4c2dae36","url":"https://www.newsfirst.lk/2021/04/07/price-of-brown-sugar-reduced-by-rs-10/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"COLOMBO (News 1st): The Ceylon Sugar Corporation has reduced the price of Brown Sugar by Rs. 10.Consumers can purchase Brown Sugar at Rs. 115 per kilo, Janaka Wakkumbura, the State Minister of Development of Minor Crops and Export Promotion told News 1st on Wednesday (Apr. 07).“Brown Sugar will be issued to Sathosa outlets at Rs. 110 per kilo and Sathosa has been informed to sell Brown Sugar at Rs. 115 in order to provide relief to the consumers during the festive season,” State Minister Janaka Wakkumbura pointed out.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"100,000 doses of Sputnik-V COVID-19 jabs to SL next week","post":"2021-04-07-news-lk-3957-4165b4b1","url":"https://www.newsfirst.lk/2021/04/07/100000-doses-of-sputnik-v-covid-19-jabs-to-sl-next-week/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"COLOMBO (News 1st): A consignment of 100,000 doses of the Sputnik-V COVID-19 Vaccine manufactured in Russia, will arrive in Sri Lanka on the 12th of April, the State Pharmaceutical Corporation of Sri Lanka (SPC) said.This would be the first consignment of the seven (07) million doses of Sputnik-V jabs ordered by Sri Lanka, Dinusha Dasanayake, the General Manager at the State Pharmaceutical Corporation told News 1st on Wednesday (Apr. 07).According to Dasanayake, the manufacturer has agreed to provide the remaining consignments on a monthly basis.Whilst pointing out that the 2nd dose of the Sputnik-V jab must be administered in 21-days since the 1st dose, Dasanayake noted that both the 1st and 2nd doses of the jab will arrive in Sri Lanka on the 12th of April.Commenting on the AstraZeneca COVID-19 jab, the General Manager of SPC said a definite date as to when the one million doses of the vaccine order will be sent to Sri Lanka, is yet to be announced.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"2000 metric tonnes of paddy converted to rice released to market","post":"2021-04-07-news-lk-37cc-43b7b29c","url":"https://www.newsfirst.lk/2021/04/07/2000-metric-tonnes-of-paddy-converted-to-rice-released-to-market/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"COLOMBO (News 1st): A stock of 2000 metric tonnes of paddy purchased by the government was so far converted to rice and released to the local market, the Paddy Marketing Board said.These rice stocks are available for consumers to be purchased through Sathosa outlets and supermarket chains, Duminda Priyadharshana, the Deputy Chairman at the Paddy Marketing Board told News 1st on Wednesday (Apr. 07).“Consumers can purchase rice at the government-imposed maximum retail prices of Rs. 96 per kilo of Nadu rice and Rs. 93 per kilo of Kekulu rice through Sathosa and supermarket chains,” Duminda Priyadharshana reiterated.The Paddy Marketing Board has so far purchased 40,000 metric tonnes of paddy.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"Junior Hospital staff launch trade union action","post":"2021-04-07-news-lk-d1e9-4f319b34","url":"https://www.newsfirst.lk/2021/04/07/junior-hospital-staff-launch-trade-union-action/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"COLOMBO (News 1st): The junior staff at hospitals have launched a trade union action on Wednesday (Apr. 07) by reporting sick.The trade union action launched citing 11 demands will be carried out throughout the day, Ven. Tampitiye Sugathananda Thero, the General Secretary of the Joint Health Workers Union told News 1st on Wednesday (Apr. 07).“The respective authorities were informed in writing to resolve the prevailing issues adding discussions were also held with the Ministry of Health on three separate occasions,” he noted.However, according to Ven. Tampitiye Sugathananda Thero, the issues faced by junior staff at hospitals including the payment of salaries for working on Saturdays, are yet to be resolved.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588","post":"2021-04-07-news-lk-f126-4e42a627","url":"https://www.newsfirst.lk/2021/04/07/02-covid-19-deaths-on-tuesday-05-fatalities-rise-to-588/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"COLOMBO (News 1st): The Director-General of Health Services confirmed that TWO (02) COVID-19 deaths were reported in the country on Tuesday (Apr. 06), raising Sri Lanka’s COVID-19 death toll to 588.The details of the deceased are as follows:01. A 70-year-old male from Bibila. He was diagnosed as infected with COVID-19 virus while receiving treatment at Bibila Base Hospital and transferred to Homagama Base Hospital, where he died on 04.04.2021. The cause of death is mentioned as Acute Renal Failure, Covid pneumonia, and Septicaemia.02. A 47-year-old male from Mahaoya, Ampara. He was diagnosed as infected with COVID-19 virus while receiving treatment at Maharagama Apeksha Hospital and transferred to Angoda Base Hospital, where he died on 05.04.2021. The cause of death is mentioned as Covid pneumonia and terminal Acute Lymphoblastic Leukaemia.Meanwhile, another 158 new positive cases were reported on Tuesday (Apr. 06), raising the COVID-19 caseload in the country to 93,772, the Department of Government Information said.As of Wednesday (Mar. 07), there are 2476 active patients receiving treatment, while 90,708 have recovered.According to the Epidemiology Unit, 4201 people received the COVID-19 jab on Tuesday (Apr. 06); and so far, 924,536 people have been vaccinated in the country.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share:  "},{"title":"Indo-Lanka religious, cultural ties to be strengthened","post":"2021-04-07-news-lk-70a6-45f08c3e","url":"https://www.newsfirst.lk/2021/04/06/indo-lanka-religious-cultural-ties-to-be-strengthened/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"COLOMBO (News1st): Attention has been drawn to reinvigorate religious and cultural ties between Sri Lanka and India during the first meeting of the Supreme Buddhist Advisory Committee on Indo- Sri Lanka relations.The first meeting of the Supreme Buddhist Advisory Committee on Indo-Sri Lanka named by Milinda Moragoda, who has been nominated as the Sri Lankan High Commissioner to India, was held at the Charikaramaya affiliated to the Ministry of Buddha Sasana yesterday.The meeting was headed by the Anunayake of the Malwathu Chapter of the Siam Sect Venerable Dr Niyangoda Vijithasiri Thero.It has been decided at the meeting to take relevant steps to revitalize religious and cultural tied between the two nations.Attention has also been drawn towards coordinating with the places of lodging of Sri Lankan monks in India and providing facilities for Buddhist pilgrims.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"Tense situation at SLSI over harmful products in the market","post":"2021-04-07-news-lk-33f4-4efa9332","url":"https://www.newsfirst.lk/2021/04/06/tense-situation-at-slsi-over-harmful-products-in-the-market/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"COLOMBO (News1st): A tense situation arose at the Sri Lanka Standards Institute (SLSI) after officials refused to divulge details of products containing harmful substances.Members of the Sinhale Movement visited the SLSI seeking details on consumer products containing harmful substances, based on the SLSI Director-General to the media.However, the members of the Sinhale movement were denied entry to the premises of the Sri Lanka Standards Institute.“Who’s law is being enacted? Who ordered for the gate to be locked? We will teach you a lesson,” a member of the Sinhale movement questioned.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"(VIDEO) “I dedicate my crown to all single-mothers” – Mrs. Sri Lanka","post":"2021-04-07-news-lk-d1cb-46b4bfc4","url":"https://www.newsfirst.lk/2021/04/06/video-i-dedicate-my-crown-to-all-single-mothers-mrs-sri-lanka/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"Colombo (News 1st); The winner of Sri Lanka’s biggest beauty pageant Pushpika De Silva said Sunday’s (04) incident at the Mrs. Sri Lanka finale was unexpected.In an emotional media briefing, De Silva said she wanted to win the pageant on behalf of all single mothers in Sri Lanka, just like her.“I am not divorced and I am still married. However, even a person who is divorced should be allowed to enter such pageants,” she told reporters on Tuesday (06).Mrs. Sri Lanka-World Director, Chandimal Jayasinghe said Mrs. World Caroline Jurie made the controversial announcement to strip Pushpika De Silva of her crown after the Chief Guest and other invitees left the premises.‘Mrs. World Inc had requested Caroline Jurie to apologize for her actions,” he said.Caroline Jurie, the reigning Mrs. World visited the Cinnamon Gardens Police on Tuesday (06) following a complaint filed by Pushpika De Silva against the incident which took place on Sunday (04).Mrs. World Inc says the actions of current title holder Mrs. Caroline Jurie, Mrs. World 2020, go against the Mrs. Sri Lanka code of conduct and the predetermined regulations she is obliged to follow during her reign.In a press statement, Mrs. World Inc said it is deeply disturbed and sincerely regrets the behavior of the current titleholder, Mrs. Caroline Jurie.“We will review the aforementioned incident and we’ll be taking steps, as deemed appropriate, based on the outcome of our assessment,” said the statement.It added, Mrs. Sri Lanka-World Director, Chandimal Jayasinghe will request Caroline Jurie to issue a personal statement apologizing for her conduct.Ugly scenes were reported over the weekend when Pushpika De Silva won the title of Mrs. Sri Lanka, only to end up in the hospital with head wounds after Mrs. World ripped off her crown in a snit to bestow it on the runner-up.Mrs. World Caroline Jurie on Sunday (04) at the pageant, claimed De Silva was actually divorced and thus disqualified from holding the title.“There is a rule that states you have to be married and not divorced, so I am taking steps to make the crown go to the first runner-up,” Jurie told the stunned crowd.Jurie then took away the gold crown off De Silva’s head and put it on the runner-up, prompting tears and chaos.Pushpika De Silva posted a photo of herself in a hospital bed on her Facebook page — while denying she is divorced.“I say a true queen is not a woman who snatches another woman’s crown, but a woman who [helps straighten] another woman’s crown,” she said in a separate post on Facebook.She acknowledged she and her husband live apart but insisted, “I’m not a divorced woman.”On Monday (05) organizers announced Pushpika De Silva will be re-crowned as Mrs. Sri Lanka for Mrs. World.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"Wife alleges foul play in Indian husband’s death, who was remanded for vandalism","post":"2021-04-07-news-lk-3114-4190bdee","url":"https://www.newsfirst.lk/2021/04/06/wife-alleges-foul-play-in-indian-husbands-death-who-was-remanded-for-vandalism/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"Colombo (News 1st); The Sri Lankan wife of an Indian national who died in hospital while in remand custody claims there is serious doubt over the sudden death of her husband.45-year-old Dilip Kumar, an Indian national, was arrested by Sri Lanka Police for allegedly vandalizing Buddha statues in Kuliyapitiya and was remanded to the 19th of April.However, he died at the Wariyapola Hospital after suddenly falling ill at the Wariyapola Police.Prisons Commissioner General Thushara Upul Deniya speaking to News 1st said the suspect was taken to hospital on Monday (06) night after he suddenly fell ill.Wariyapola District Magistrate Sanjeewa Ramyakumara ordered for the body to be moved to the Kurunegala Teaching Hospital for a PCR test and the examination of the Judicial Medical Officer.The Department of Prisons said the deceased was a dual citizen who was living in Sri Lanka for 15 years.This was not the first time an Indian made headlines by being arrested in Sri Lanka.Back in 2018, Marceli Thomas, an Indian national was arrested for possible links to an alleged plot to assassinate then-Sri Lankan President Maithripala Sirisena as well as Gotabaya Rajapaksa, who at the time was not President, but was the country’s Ex-Secretary of Defence.Marceli Thomas was arrested on 26th September 2018.Then-Police Spokesperson SP Attorney-at-Law Ruwan Gunasekera said Thomas arrived in Sri Lanka in January 2017.Several days after his arrest, the Indian High Commission was quoted as saying that after due diligence, they had found that Thomas had a history of mental illness since 2000.Thomas was termed mentally unfit and was put under the care of doctors at a hospital of mental care near Colombo.Thomas claimed innocence and alleged that the police are trying to frame him in the case.Later on, on the 27th of February 2019, the court acquitted the Indian national and since then, nothing was heard from Thomas who appears have to have gone dark.Did he go back to India? Or is he still in Sri Lanka with an alias?However, there are serious concerns now as to why in 2021, an Indian national made his way alone to Kuliyapitiya to allegedly cause damage to Buddhist statues.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"“If Sarah Jasmine is alive, she will be arrested” – Sarath Weerasekera","post":"2021-04-07-news-lk-6c73-48538d43","url":"https://www.newsfirst.lk/2021/04/06/if-sarah-jasmine-is-alive-she-will-be-arrested-sarath-weerasekera/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"Colombo (News 1st); It is impossible to claim if Sarah Jasmine (Pulasthini Rajendran) had died from the explosions in the east in 2019, said Public Security Minister Rear Admiral (Retd) Dr. Sarath Weerasekara.He said the first DNA test had not confirmed her death nor her survival.The minister was speaking at the briefing organized by the President-appointed six-member Committee to study in-depth the facts and recommendations on the course of action contained in the final report of the Presidential Commission of Inquiry (PCoI) into 2019 April 21st Attacks and the report of the Sectoral Oversight Committee on National Security which was submitted to Parliament.“The first DNA tests did not match with her mother. The remains will be exhumed for DNA tests to be carried out, as the bodies are in pieces,” said the Minister.The Minister said if it is proven that Sarah Jasmine is not dead, a RED NOTICE will be issued via INTERPOL for her arrest.Further, the Minister said there is no evidence to claim that a Police Officer had assisted Sarah Jasmine to escape Sri Lanka.“54 people connected these attacks were arrested overseas and 50 of them were deported to Sri Lanka,” said the Minister.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "},{"title":"Sun is overhead at several places ","post":"2021-04-07-sunday-observer-8b43-4b2d9ef8","url":"http://www.sundayobserver.lk/2021/04/07/news/sun-overhead-several-places","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"Showers or thundershowers will occur at a several places in Western, Sabaragamuwa and Central provinces and in Galle and Matara districts in the evening or night, stated the Department of Meteorology. Fairly heavy falls above 50 mm can be expected at some places in above areas.Mainly fair weather will prevail elsewhere over the island.Misty conditions can be expected at some places in Central, Sabaragamuwa and Western provinces during the morning.            General public is kindly requested to take adequate precautions to minimize damages caused by temporary localized strong winds and lightning during thundershowers.On the apparent northward relative motion of the sun, it is going to be directly over the latitudes of Sri Lanka during 05th to 14th of April in this year. The nearest areas of Sri Lanka over which the sun is overhead today (07th), are Colombo, Malwana, Kosgama, Sitawaka, Maldeniya, Rozella, Talawakele, Sita-Eliya, Ettampitiya, Passara, Warralanda and Paladi Kalapuwa at about 12:13 noon."},{"title":"Nawfer Moulavi, mastermind behind Easter Attacks","post":"2021-04-07-sunday-observer-2d8e-4a48b711","url":"http://www.sundayobserver.lk/2021/04/06/news/nawfer-moulavi-mastermind-behind-easter-attacks","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"The government today officially announced that Nawfer Moulavi who is in remand custody has been identified as the mastermind behind the Easter Sunday attacks that killed more than 270 innocent civilians on April 21, 2019.According to Public Security Minister Dr. Sarath Weerasekera, Nawfer Moulavi who is in remand custody, has been involved in brainwashing Saharan Hashim’s team into following the Islamic State ideology.Addressing a press conference at the Information Department today, Weerasekera said Nawfer Moulavi has started propagating ideologies of the Islamist State terrorists in 2014."},{"title":"Covid-19 recovery: 145 patients recover","post":"2021-04-07-sunday-observer-d715-436d8651","url":"http://www.sundayobserver.lk/2021/04/06/news/covid-19-recovery-145-patients-recover","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"145 Covid-19 patients recovered, confirmed the Epidemiology Unit.Total of 90 708 patients recovered across the country."},{"title":"06 M Sputnik V vaccines to be purchased ","post":"2021-04-07-sunday-observer-b559-47b4815e","url":"http://www.sundayobserver.lk/2021/04/06/news/06-m-sputnik-v-vaccines-be-purchased","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"The Cabinet of Ministers has granted permission to purchase of 06 million doses of Sputnik V Covid-19 vaccine.  "},{"title":"Sun is overhead at several places ","post":"2021-04-07-sunday-observer-0092-41f3bbc2","url":"http://www.sundayobserver.lk/2021/04/06/news/sun-overhead-several-places","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"Showers or thundershowers may occur at a few places in Western and Sabaragamuwa provinces and in Galle, Matara and Nuwara-Eliya districts in the evening or night, stated the Department of Meteorology.Mainly fair weather will prevail elsewhere over the island.Misty conditions can be expected at some places in Central, Sabaragamuwa and Western provinces during the morning.            On the apparent northward relative motion of the sun, it is going to be directly over the latitudes of Sri Lanka during 05th to 14th of April in this year. The nearest areas of Sri Lanka which the sun is overhead today (06th), are Dodangoda, Iddagoda, Agalawatta, Athweltota, Ranwala, GodaweliPokuna Hela and Kumana Wewa at about 12:13 noon."},{"title":"Covid-19 Cluster: 37 more tested positive ","post":"2021-04-07-sunday-observer-dd50-423ab8ae","url":"http://www.sundayobserver.lk/2021/04/05/news/covid-19-cluster-37-more-tested-positive","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"37 more persons tested positive for Covid-19, confirmed the Department of Government Information.Among them, 36 are associates of Peliyagoda Covid-19 Cluster and 01 are prisoners. The total of 137 cases reported today (05) so far.The total number of confirmed cases rises to 88 684 from Covid-19 Clusters.             "},{"title":"Importation of palm oil banned ","post":"2021-04-07-sunday-observer-31ac-4ad481b5","url":"http://www.sundayobserver.lk/2021/04/05/news/importation-palm-oil-banned","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"President Gotabaya Rajapaksa has banned the importation of palm oil with immediate effect, said the President’s Media Division."},{"title":"05 Covid-19 deaths reported in SL ","post":"2021-04-07-sunday-observer-93b9-46fc8fc2","url":"http://www.sundayobserver.lk/2021/04/05/news/05-covid-19-deaths-reported-sl","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"05 Covid-19 deaths reported in Sri Lanka, confirmed the Epidemiology Unit.The death toll is at 586."},{"title":"Covid-19 Cluster: 100 tested positive","post":"2021-04-07-sunday-observer-aaaa-4b9183b8","url":"http://www.sundayobserver.lk/2021/04/05/news/covid-19-cluster-100-tested-positive","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"100 persons tested positive for Covid-19, confirmed the Department of Government Information.Among them, 84 are associates of Peliyagoda Covid-19 Cluster and 16 are prisoners. The total of 100 cases reported today (05) so far.The total number of confirmed cases rises to 88 647 from Covid-19 Clusters.             "},{"title":"Covid-19 recovery: 335 recover","post":"2021-04-07-sunday-observer-bd7d-4faa876a","url":"http://www.sundayobserver.lk/2021/04/05/news/covid-19-recovery-335-recover","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"335 Covid-19 patients recovered, confirmed the Epidemiology Unit.A total of 90 563 individuals recovered while 93 436 confirmed cases were reported.  There are 2 292 active cases across the country.The death toll in the country is at 581.            "},{"title":"Heat advisory index issued ","post":"2021-04-07-sunday-observer-7c80-4da0a2ef","url":"http://www.sundayobserver.lk/2021/04/05/news/heat-advisory-index-issued","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"The Natural Hazards Early Warning Centre issued a heat advisory for several districts.The advisory said, ‘the temperature felt on human body is expected to increase up to ‘Extreme Caution’ level at some places in Mullaitivu, Vauniya, Puttalam, Kurunegala, Anuradhapura, Polonnaruwa and Monaragala districts.’ "},{"title":"‘Real queens fix each other’s crowns’- Pushpika ","post":"2021-04-07-sunday-observer-44ba-4958b8c8","url":"http://www.sundayobserver.lk/2021/04/05/news/%E2%80%98real-queens-fix-each-other%E2%80%99s-crowns%E2%80%99-pushpika","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"Pushpika De Silva was announced as the winner of Mrs. Sri Lanka for Mrs. World pageant and was crowned by Mrs. World Caroline Jurie last night (04).However, Jurie later announced that the winner cannot contest as she was a divorcee and decided to crown the first-runner up as the new winner instead.On Facebook statement, De Silva said 'Living separately and being divorced are two completely separate things,' emphasising that she is not a divorcee even at the moment of posting the statement.            De Silva further said 'Real queens fix each other’s crowns'. "},{"title":"Court rejects Ranjan’s writ appeal ","post":"2021-04-07-sunday-observer-cc72-4d86b9b8","url":"http://www.sundayobserver.lk/2021/04/05/news/court-rejects-ranjan%E2%80%99s-writ-appeal","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"The writ petition filed by lawyers of imprisoned Minister Ranjan Ramanayake claiming his rights to function as a Parliamentarian was dismissed by the Court of Appeal today (05)."},{"title":"Sinopharm inoculation begins today ","post":"2021-04-07-sunday-observer-a739-411b886d","url":"http://www.sundayobserver.lk/2021/04/05/news/sinopharm-inoculation-begins-today","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"The Sinopharm vaccination programme begins today (05), said the State Minister of Production, Supply and Regulation of Pharmaceuticals Prof. Channa Jayasumana.The inoculation is to be given to the Chinese nationals in the country, initially.A consignment of 600 000 vaccines arrived in Sri Lanka last week.               "},{"title":"Sun is overhead till 14th ","post":"2021-04-07-sunday-observer-6d6c-479fae05","url":"http://www.sundayobserver.lk/2021/04/05/news/sun-overhead-till-14th","site":"Sunday Observer","date":"4/7/2021, 10:04:40 AM","content":"Showers or thundershowers may occur at a few places in Sabaragamuwa province and in Kalutara, Galle and Matara districts in the evening or night, stated the Department of Meteorology.Mainly fair weather will prevail over elsewhere of the island. Misty conditions can be expected at some places in Central, Sabaragamuwa and Western provinces during the morning.             On the apparent northward relative motion of the sun, it is going to be directly over the latitudes of Sri Lanka during 05th to 14th of April in this year. The nearest areas of Sri Lanka over which the sun is overhead today (05), are Thelwatta, Baddegama, Dediyawala, Mulatiyana, Agunakolapelessa and Udamalala at about 12.13 noon."}]
