[{"title":"(VIDEO) Sirisena disappointed over Cardinal’s comments","post":"2021-04-06-news-lk-9bb4-4cd5a3dc","url":"https://www.newsfirst.lk/2021/04/05/video-sirisena-disappointed-over-cardinals-comments/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); Former President Maithripala Sirisena on Monday (05) said he is disappointed over the statement made by Archbishop of Colombo His Eminence Malcolm Cardinal Ranjith on Sunday (04).His Eminence Malcolm Cardinal Ranjith accused former president Maithripala Sirisena of shirking his responsibilities and acting irresponsibly over the April 21st attacks, that occurred under his presidency.When reporters questioned Sirisena on the Cardinal’s comments, the former said very little and left.General Secretary of the Sri Lanka Freedom Party, Minister Dayasiri Jayasekera said Maithripala Sirisena is being targeted to destroy the SLFP.“There was a Prime Minister and Ministers in that government. Yet, only then-President Sirisena is being held responsible. The statement against the then-President speaks of politics,” said Jayasekera.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare:  "},{"title":"(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleagues","post":"2021-04-06-news-lk-45ad-4692ae27","url":"https://www.newsfirst.lk/2021/04/05/video-pahanata-thel-protest-confronted-by-slpp-colleagues/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); An Ambalangoda Urban Council member representing the Sri Lanka Podujana Peramuna who was protecting on Monday (05) morning, was confronted by several local politicians from his own camp.The lone politico identified as Gratien Keraminiyage from the Sri Lanka Podujana Peramuna and also representing a movement called ‘Pahanata Thel’ was protesting against acts of intimidation at the Batapola Town and he was confronted by SLPP members Saman Mawananhewa and Kingsley Weerasiri.The two local government politicians condemned the protests by their colleague.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"Cabinet panel appointed to study PCoI report, submits final report to President","post":"2021-04-06-news-lk-83dd-4471b149","url":"https://www.newsfirst.lk/2021/04/05/cabinet-panel-appointed-to-study-pcoi-report-submits-final-report-to-president/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); The six-member ministerial committee appointed to study the report of the Presidential Commission of Inquiry on the 2019 April 21st Attacks and the report presented to Parliament by the Sectoral Oversight Committee on National Security, handed over its final report to the President on Monday (05).The committee is chaired by Minister Chamal Rajapaksa and Ministers Johnston Fernando, Udaya Gammanpila, Ramesh Pathirana, Prasanna Ranatunga and Rohitha Abeygunawardene are the other members.The committee was appointed on the 19th of February 2021 and it was originally scheduled to submit the report before the 15th of March 2021.However, due to the need to investigate the matter in-depth, the committee obtained two more weeks to finalize its report.According to the President’s Media Division, the Cabinet-appointed ministerial committee had identified 78 recommendations upon studying the 2019 April 21st Attacks PCoI report.The ministerial committee in its report had detailed on what recommendations should be implemented and by which institution.Hariguptha Rohanadheera, the Director-General (Legal), Presidential Secretariat was appointed as the Secretary to the Committee in order to facilitate the activities and to carry out other functions of the Committee.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"Chinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th April","post":"2021-04-06-news-lk-2096-4625893c","url":"https://www.newsfirst.lk/2021/04/05/chinese-in-sl-given-sinopharm-jab-02nd-dose-for-sri-lankans-on-19th-april/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); The vaccination of Chinese nationals in Sri Lanka with the Sinopharm vaccine commenced on Monday (05) at the Colombo Port City, Hambantota, Kandy, and Puttlam.The Ministry of Health said approximately 4000 Chinese nationals in Sri Lanka were given the vaccine.600,000 doses of China’s Sinopharm vaccines arrived in Sri Lanka from China on 29th March as part of a donation by the Chinese government to the island nation.Although Sri Lanka’s National Medicine Regulatory Authority (NMRA) has approved the decision to bring in the Chinese vaccine, they have not approved its use on Sri Lankans.Over 900,000 Sri Lankans were given the Oxford/AstraZeneca COVID-19 vaccine since January 2021.Over 1.2 million doses of the Oxford/AstraZeneca COVID-19 vaccine reached Sri Lanka on three separate occasions.Accordingly, Sri Lanka has 300,000 un-used doses of the Oxford/AstraZeneca COVID-19 vaccine and they will be administered as the second dose on Sri Lankans who already received the jab from the 19th of April 2021.However, India, one of the world’s largest producers of coronavirus vaccines, has temporarily halted all exports of the AstraZeneca vaccine citing the need to prioritize its own needs.Sri Lanka’s State Minister of Primary Health Care, Epidemics, and COVID Disease Control Dr. Sudarshini Fernandopulle said the second dose of the vaccine will be administered from April 19th to June 30th and more vaccines are to be expected via the COVAX program while some will be procured.The Deputy Representative of UNICEF in Sri Lanka, Emma Brigham, at the media briefing on Monday (05) said UNICEF is currently in talks with COVAX and all involved parties as well as the Indian Government and Serum Institute for the procurement of the vaccines.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"Importing Palm Oil suspended with immediate effect","post":"2021-04-06-news-lk-2f65-4a1fa049","url":"https://www.newsfirst.lk/2021/04/05/importing-palm-oil-suspended-with-immediate-effect/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); President Gotabaya Rajapaksa had ordered to immediately suspend Palm Oil imports to Sri Lanka.According to the President’s Media Division, the President’s Secretary had informed the Department of Imports and Exports Control to issue the respective gazette on Monday (05).The Director-General of Customs was also instructed to immediately suspend the release of Palm Oil already imported to Sri Lanka.In addition, Palm cultivation in Sri Lanka will be completely prohibited.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"Pushpika De Silva re-crowned Mrs. Sri Lanka 2021","post":"2021-04-06-news-lk-830e-4984bb5e","url":"https://www.newsfirst.lk/2021/04/05/pushpika-de-silva-re-crowned-mrs-sri-lanka-2021/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st);  Reports have confirmed that Pushpika De Silva was re-crowned as Mrs Sri Lanka for Mrs World on Monday (05), following a dramatic end to Sunday’s (04) pageant.The Mrs. Sri Lanka 2021 pageant held at the Nelum Pokuna Theatre on Sunday (04) night concluded in a melee after the reigning Mrs. World Caroline Jurie stripped the winner of her crown after she was announced.The Crown for Mrs. Sri Lanka 2021 went to the first runner-up instead.According to video footage Pushpika De Silva, contestant number 20 was announced as Mrs. Sri Lanka 2021 and was crowned by Shiranthi Rajapaksa, Mayor Rosy Senanayake, and Chandimal Jayasinghe.However, when Pushpika De Silva was about to take center stage and cherish the moment, Caroline Jurie stormed on stage and said the pageant rule note that divorcees cannot be crowned as winners and took away the crown from De Silva, despite some protests from the winner.She charged that Pushpika De Silva was a divorcee and hence was ineligible to win the crown.Mrs. World 2020 Caroline Jurie was seen placing the crown on the first runner-up’s head while Pushpika De Silva stormed off stage.Pushpika De Silva insists she had not violated the pageant rules.Pushpika De Silva in a statement on her official Facebook account penned that she is not a divorcee and challenged the organizers to produce any document to claim that she was divorced.“Living separately and being divorced are two completely separate things,” she said in the statement stressing that she is not a divorcee even at the time of posting the statement.“Real queens fix each other’s crowns,” she said in the statement.Pushpika De Silva went on to note that if she was not suitable for the contest, she should have been removed at the very beginning adding the organizers could not have been asleep when she was moving ahead in the pageant.“I have already taken the necessary legal action against the injustice and humiliation caused to me at the event,” she added.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"No New Year Festivals in Colombo ; CMC Chief Medical Officer","post":"2021-04-06-news-lk-2a29-4c928f13","url":"https://www.newsfirst.lk/2021/04/05/no-new-year-festivals-in-colombo-cmc-chief-medical-officer/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st);  Permission will not be granted to organize New Year festivals in the Colombo City, said Dr. Jayaruwan Bandara, the Chief Medical Officer of the Colombo Municipal Council on Monday (05).Shopping festivals will also be prohibited during the said period, he said adding permission will not be granted for any event which would involve public gatherings.“The COVID-19 spread in Colombo was controlled, yet, the people are urged to avoid gatherings,” he stressed.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"Special train service during April festive season","post":"2021-04-06-news-lk-9c6e-4c948b79","url":"https://www.newsfirst.lk/2021/04/05/special-train-service-during-april-festive-season/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); Special Trains will be in operation for the Sinhala and Tamil New Year, said the Department of Railways.In a statement issued via the Department of Government Information, 21 special trains will operate to Badulla, Jaffna, Kurunegala, Anuradhapura, Beliatte, and several other areas from the 09th of April. Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"CoA permits to proceed with petition challenging daily wage increase","post":"2021-04-06-news-lk-09b9-4f149e00","url":"https://www.newsfirst.lk/2021/04/05/coa-permits-to-proceed-with-petition-challenging-daily-wage-increase/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); The Court of Appeal on Monday (05) permitted to take up for examination the writ application filed by 20 Plantation Companies challenging the government-issue gazette on increasing the daily wage of plantation workers to Rs. 1000/-.Arguments will commence from the 05th of May, ruled the Court of Appeal.In addition, the Court of Appeal permitted the petitioners to issue notice on the respondents mentioned in the writ application, which was called up in the presence of Court of Appeal President Arjuna Obeysekera and Justice Mayadunne Corea.Labour Minister Nimal Siripala De Silva, Labour Commissioner, The Chairman, and members of the Wages Board for the Rubber Growing and Raw Rubber Manufacturing Trade among others were named as the respondents in the application.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"“Did not violate pageant rules, will take legal action against incident” – Pushpika","post":"2021-04-06-news-lk-66a7-4ac4b102","url":"https://www.newsfirst.lk/2021/04/05/did-not-violate-pageant-rules-will-take-legal-action-against-incident-pushpika/","site":"News Lk","date":"4/6/2021, 7:45:00 AM","content":"Colombo (News 1st); Pushpika De Silva, the 2021 Mrs. Sri Lanka winner who was stripped of her crown on Sunday (04) night following a dramatic ending to the pageant insists she had not violated the pageant rules.On Sunday (04) night, De Silva was announced as the winner and was crowned by Mrs. World Caroline Jurie, while she was congratulated on stage by the Chief Guest, Shiranthi Rajapaksa.However, Jurie later made an announcement saying the winner was divorced and cannot contest and so she has decided to crown the first-runner up as the new winner.Pushpika De Silva in a statement on her official Facebook account penned that she is not a divorcee and challenged the organizers to produce any document to claim that she was divorced.“Living separately and being divorced are two completely separate things,” she said in the statement stressing that she is not a divorcee even at the time of posting the statement.“Real queens fix each other’s crowns,” she said in the statement.Pushpika De Silva went on to note that if she was not suitable for the contest, she should have been removed at the very beginning adding the organizers could not have been asleep when she was moving ahead in the pageant.“I have already taken the necessary legal action against the injustice and humiliation caused to me at the event,” she added.Latest News (VIDEO) Sirisena disappointed over Cardinal’s comments(VIDEO) ‘Pahanata Thel’ protest confronted by SLPP colleaguesCabinet panel appointed to study PCoI report, submits final report to PresidentChinese in SL given Sinopharm jab; 02nd dose for Sri Lankans on 19th AprilImporting Palm Oil suspended with immediate effectShare: "},{"title":"Covid-19 Cluster: 37 more tested positive ","post":"2021-04-06-sunday-observer-4920-40479f8a","url":"http://www.sundayobserver.lk/2021/04/05/news/covid-19-cluster-37-more-tested-positive","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"37 more persons tested positive for Covid-19, confirmed the Department of Government Information.Among them, 36 are associates of Peliyagoda Covid-19 Cluster and 01 are prisoners. The total of 137 cases reported today (05) so far.The total number of confirmed cases rises to 88 684 from Covid-19 Clusters.             "},{"title":"Importation of palm oil banned ","post":"2021-04-06-sunday-observer-f353-4f7b8730","url":"http://www.sundayobserver.lk/2021/04/05/news/importation-palm-oil-banned","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"President Gotabaya Rajapaksa has banned the importation of palm oil with immediate effect, said the President’s Media Division."},{"title":"05 Covid-19 deaths reported in SL ","post":"2021-04-06-sunday-observer-e3a4-45e5a181","url":"http://www.sundayobserver.lk/2021/04/05/news/05-covid-19-deaths-reported-sl","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"05 Covid-19 deaths reported in Sri Lanka, confirmed the Epidemiology Unit.The death toll is at 586."},{"title":"Covid-19 Cluster: 100 tested positive","post":"2021-04-06-sunday-observer-c9ac-48ad99b6","url":"http://www.sundayobserver.lk/2021/04/05/news/covid-19-cluster-100-tested-positive","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"100 persons tested positive for Covid-19, confirmed the Department of Government Information.Among them, 84 are associates of Peliyagoda Covid-19 Cluster and 16 are prisoners. The total of 100 cases reported today (05) so far.The total number of confirmed cases rises to 88 647 from Covid-19 Clusters.             "},{"title":"Covid-19 recovery: 335 recover","post":"2021-04-06-sunday-observer-ce50-43a38102","url":"http://www.sundayobserver.lk/2021/04/05/news/covid-19-recovery-335-recover","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"335 Covid-19 patients recovered, confirmed the Epidemiology Unit.A total of 90 563 individuals recovered while 93 436 confirmed cases were reported.  There are 2 292 active cases across the country.The death toll in the country is at 581.            "},{"title":"Heat advisory index issued ","post":"2021-04-06-sunday-observer-de3b-417b94cb","url":"http://www.sundayobserver.lk/2021/04/05/news/heat-advisory-index-issued","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"The Natural Hazards Early Warning Centre issued a heat advisory for several districts.The advisory said, ‘the temperature felt on human body is expected to increase up to ‘Extreme Caution’ level at some places in Mullaitivu, Vauniya, Puttalam, Kurunegala, Anuradhapura, Polonnaruwa and Monaragala districts.’ "},{"title":"‘Real queens fix each other’s crowns’- Pushpika ","post":"2021-04-06-sunday-observer-4057-405983f8","url":"http://www.sundayobserver.lk/2021/04/05/news/%E2%80%98real-queens-fix-each-other%E2%80%99s-crowns%E2%80%99-pushpika","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"Pushpika De Silva was announced as the winner of Mrs. Sri Lanka for Mrs. World pageant and was crowned by Mrs. World Caroline Jurie last night (04).However, Jurie later announced that the winner cannot contest as she was a divorcee and decided to crown the first-runner up as the new winner instead.On Facebook statement, De Silva said 'Living separately and being divorced are two completely separate things,' emphasising that she is not a divorcee even at the moment of posting the statement.            De Silva further said 'Real queens fix each other’s crowns'. "},{"title":"Court rejects Ranjan’s writ appeal ","post":"2021-04-06-sunday-observer-99d3-40f9aba7","url":"http://www.sundayobserver.lk/2021/04/05/news/court-rejects-ranjan%E2%80%99s-writ-appeal","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"The writ petition filed by lawyers of imprisoned Minister Ranjan Ramanayake claiming his rights to function as a Parliamentarian was dismissed by the Court of Appeal today (05)."},{"title":"Sinopharm inoculation begins today ","post":"2021-04-06-sunday-observer-00dc-4fc3b825","url":"http://www.sundayobserver.lk/2021/04/05/news/sinopharm-inoculation-begins-today","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"The Sinopharm vaccination programme begins today (05), said the State Minister of Production, Supply and Regulation of Pharmaceuticals Prof. Channa Jayasumana.The inoculation is to be given to the Chinese nationals in the country, initially.A consignment of 600 000 vaccines arrived in Sri Lanka last week.               "},{"title":"Sun is overhead till 14th ","post":"2021-04-06-sunday-observer-b325-41b6b561","url":"http://www.sundayobserver.lk/2021/04/05/news/sun-overhead-till-14th","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"Showers or thundershowers may occur at a few places in Sabaragamuwa province and in Kalutara, Galle and Matara districts in the evening or night, stated the Department of Meteorology.Mainly fair weather will prevail over elsewhere of the island. Misty conditions can be expected at some places in Central, Sabaragamuwa and Western provinces during the morning.             On the apparent northward relative motion of the sun, it is going to be directly over the latitudes of Sri Lanka during 05th to 14th of April in this year. The nearest areas of Sri Lanka over which the sun is overhead today (05), are Thelwatta, Baddegama, Dediyawala, Mulatiyana, Agunakolapelessa and Udamalala at about 12.13 noon."},{"title":"Covid-19 Cluster: 25 more tested positive","post":"2021-04-06-sunday-observer-8e74-48179607","url":"http://www.sundayobserver.lk/2021/04/04/news/covid-19-cluster-25-more-tested-positive","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"25 more persons tested positive for Covid-19, confirmed the Department of Government Information.Among them, 18 are associates of Peliyagoda Covid-19 Cluster and 07 are prisoners. The total of 122 cases reported today (04) so far.            The total number of confirmed cases rises to 88 547 from Covid-19 Clusters."},{"title":"Covid-19 Cluster: 97 tested positive","post":"2021-04-06-sunday-observer-0a92-49689586","url":"http://www.sundayobserver.lk/2021/04/04/news/covid-19-cluster-97-tested-positive","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"97 persons tested positive for Covid-19, confirmed the Department of Government Information.All are associates of Peliyagoda Covid-19 Cluster. The total of 97 cases reported today (04) so far.            The total number of confirmed cases rises to 88 522 from Covid-19 Clusters."},{"title":"Covid-19 recovery: 187 recover","post":"2021-04-06-sunday-observer-5089-4924b7cc","url":"http://www.sundayobserver.lk/2021/04/04/news/covid-19-recovery-187-recover","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"187 Covid-19 patients recovered, confirmed the Epidemiology Unit.A total of 90 208 individuals recovered while 93 295 confirmed cases were reported.  There are 2 506 active cases across the country.The death toll in the country is at 581.            "},{"title":"02 Covid-19 deaths reported in SL ","post":"2021-04-06-sunday-observer-d920-44578c52","url":"http://www.sundayobserver.lk/2021/04/04/news/02-covid-19-deaths-reported-sl","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"02 Covid-19 deaths reported in Sri Lanka, confirmed the Epidemiology Unit.The death toll is at 581."},{"title":"‘Aluth Sahal Mangalya’ held","post":"2021-04-06-sunday-observer-69b3-463d802d","url":"http://www.sundayobserver.lk/2021/04/04/news/%E2%80%98aluth-sahal-mangalya%E2%80%99-held","site":"Sunday Observer","date":"4/6/2021, 7:45:00 AM","content":"The National ‘Aluth Sahal Mangalya’ (New Rice Festival) one of the most venerated ancient agricultural rituals to offer the maiden harvest of Maha season to the Lord Buddha was held today (04) under the patronage of President Gotabaya Rajapaksa at the sacred Sri Maha Bodhiya premises.It is an annual custom to set aside the first portion of the recently recede harvest to prepare Buddha Pooja. The event was organized by the Ministry of Agriculture and the Department of Agrarian Services for the 54th time under the guidance of Chief Incumbent of Atamasthana Ven. Prof. Pallegama Sirinivasa Nayaka thero.A large number of farmers from different parts of the country were present at the traditional ceremony with the hope of receiving blessings of the nature and the Triple Gem to receive timely showers, bountiful of harvest and prosperous economy for the country.Following the ancient traditions, the New Rice Festival Perahera (procession) entered the Bo Maluwa through the eastern wahalkada amidst hewisi sounds and filled the gold-plated bowl set up in the pavilion in front of sacred Jaya Sri Maha Bodhi, with rice with great respect and devoutness.President Gotabaya Rajapaksa performed the traditional custom of filling the bowl with fresh rice amidst the chanting of Seth Pirith by the Maha Sangha led by Ven. Pallegama Sirinivasa Nayaka Thero.Afterwards, the Miniters and MPs as well as a large number of farmers from different parts of the country filled the bowl with fresh rice.The first copy of the magazine compiled by the Department of Agrarian Development to mark the New Rice Festival was presented to the President Rajapaksa by the Commissioner General of Agrarian Development  Mr.A.H.M.L. Abeyratne.Basnayake Nilame of the Saman Devalaya Nigara Jayasundara Bandara handed over the bowl of ghee to the President to pay homage to the sacred Jaya Sri Maha Bodhi.            The pure bee honey bowl traditionally offered to the sacred Jayasri Maha Bodhiya by the indigenous community was handed over to the President by Uruwarige Gunabanda representing his Leader Wannila Aththo.The President symbolically distributed seed paddy blessed with Seth Pirith to the representatives of the farmers’ unions from 9 provinces.Following the traditional ceremony, the President paid homage to the sacred Sri Maha Bodhiya, and obtained blessings.Later, the President and Madam Ioma Rajapaksa called on the Chief Incumbent of Atamasthana Ven. Prof. Pallegama Sirinivasa Nayaka thero and inquired about his well-being.The Maha Sangha, Minister of Agriculture Mahindananda Aluthgamage, Minister S.M. Chandrasena, Governor of the North Central Province Maheepala Herath, State Ministers Duminda Dissanayake, Shashindra Rajapaksa, Shehan Semasinghe, Channa Jayasumana, MP K.P.S. Kumarasiri,  and public officials were present at the occasion."}]
