{"title":"(VIDEO) “I dedicate my crown to all single-mothers” – Mrs. Sri Lanka","post":"2021-04-07-news-lk-d1cb-46b4bfc4","url":"https://www.newsfirst.lk/2021/04/06/video-i-dedicate-my-crown-to-all-single-mothers-mrs-sri-lanka/","site":"News Lk","date":"4/7/2021, 10:04:40 AM","content":"Colombo (News 1st); The winner of Sri Lanka’s biggest beauty pageant Pushpika De Silva said Sunday’s (04) incident at the Mrs. Sri Lanka finale was unexpected.In an emotional media briefing, De Silva said she wanted to win the pageant on behalf of all single mothers in Sri Lanka, just like her.“I am not divorced and I am still married. However, even a person who is divorced should be allowed to enter such pageants,” she told reporters on Tuesday (06).Mrs. Sri Lanka-World Director, Chandimal Jayasinghe said Mrs. World Caroline Jurie made the controversial announcement to strip Pushpika De Silva of her crown after the Chief Guest and other invitees left the premises.‘Mrs. World Inc had requested Caroline Jurie to apologize for her actions,” he said.Caroline Jurie, the reigning Mrs. World visited the Cinnamon Gardens Police on Tuesday (06) following a complaint filed by Pushpika De Silva against the incident which took place on Sunday (04).Mrs. World Inc says the actions of current title holder Mrs. Caroline Jurie, Mrs. World 2020, go against the Mrs. Sri Lanka code of conduct and the predetermined regulations she is obliged to follow during her reign.In a press statement, Mrs. World Inc said it is deeply disturbed and sincerely regrets the behavior of the current titleholder, Mrs. Caroline Jurie.“We will review the aforementioned incident and we’ll be taking steps, as deemed appropriate, based on the outcome of our assessment,” said the statement.It added, Mrs. Sri Lanka-World Director, Chandimal Jayasinghe will request Caroline Jurie to issue a personal statement apologizing for her conduct.Ugly scenes were reported over the weekend when Pushpika De Silva won the title of Mrs. Sri Lanka, only to end up in the hospital with head wounds after Mrs. World ripped off her crown in a snit to bestow it on the runner-up.Mrs. World Caroline Jurie on Sunday (04) at the pageant, claimed De Silva was actually divorced and thus disqualified from holding the title.“There is a rule that states you have to be married and not divorced, so I am taking steps to make the crown go to the first runner-up,” Jurie told the stunned crowd.Jurie then took away the gold crown off De Silva’s head and put it on the runner-up, prompting tears and chaos.Pushpika De Silva posted a photo of herself in a hospital bed on her Facebook page — while denying she is divorced.“I say a true queen is not a woman who snatches another woman’s crown, but a woman who [helps straighten] another woman’s crown,” she said in a separate post on Facebook.She acknowledged she and her husband live apart but insisted, “I’m not a divorced woman.”On Monday (05) organizers announced Pushpika De Silva will be re-crowned as Mrs. Sri Lanka for Mrs. World.Latest News Price of Brown Sugar reduced by Rs. 10100,000 doses of Sputnik-V COVID-19 jabs to SL next week2000 metric tonnes of paddy converted to rice released to marketJunior Hospital staff launch trade union action02 COVID-19 deaths on Tuesday (05); Fatalities rise to 588Share: "}
